# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [3]:
# Your code here
import pandas as pd
import sqlite3

conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [4]:
# Your code here
cur.execute('''SELECT e.firstName, e.lastName, o.city, o.state
               FROM employees e
               JOIN offices o
               USING(officeCode)
               ORDER BY firstName, lastName''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

   firstName   lastName           city       state
0       Andy     Fixter         Sydney
1    Anthony        Bow  San Francisco          CA
2      Barry      Jones         London
3      Diane     Murphy  San Francisco          CA
4   Foon Yue      Tseng            NYC          NY
5     George     Vanauf            NYC          NY
6     Gerard     Bondur          Paris
7     Gerard  Hernandez          Paris
8       Jeff   Firrelli  San Francisco          CA
9      Julie   Firrelli         Boston          MA
10     Larry       Bott         London
11    Leslie   Jennings  San Francisco          CA
12    Leslie   Thompson  San Francisco          CA
13      Loui     Bondur          Paris
14      Mami      Nishi          Tokyo  Chiyoda-Ku
15    Martin     Gerard          Paris
16      Mary  Patterson  San Francisco          CA
17    Pamela   Castillo          Paris
18     Peter      Marsh         Sydney
19     Steve  Patterson         Boston          MA
20       Tom       King         Sydney
21   William  Patterson         Sydney
22   Yoshimi       Kato          Tokyo  Chiyoda-Ku

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [9]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, orderNumber, orderDate, status
               FROM customers
               JOIN orders
               USING(customerNumber)''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

    contactFirstName contactLastName  orderNumber   orderDate     status
0            Carine          Schmitt        10123  2003-05-20    Shipped
1            Carine          Schmitt        10298  2004-09-27    Shipped
2            Carine          Schmitt        10345  2004-11-25    Shipped
3               Jean            King        10124  2003-05-21    Shipped
4               Jean            King        10278  2004-08-06    Shipped
..               ...             ...          ...         ...        ...
321          Valarie          Franco        10243  2004-04-26    Shipped
322             Tony         Snowden        10138  2003-07-07    Shipped
323             Tony         Snowden        10179  2003-11-11  Cancelled
324             Tony         Snowden        10360  2004-12-16    Shipped
325             Tony         Snowden        10399  2005-04-01    Shipped

[326 rows x 5 columns]

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [ ]:
# Your code here

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [ ]:
# Your code here

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!